# Pickle try

In [17]:
import pickle
import pandas as pd

In [18]:
# dict

In [19]:
# Students in my classes
# No duplicates in names
student_dict = {
    'name' : ['jack', 'Riti', 'Aadi','prada','Ramesh','Niscal','zu','Eric'],
    'subject':['CS','Math','English','Physics','Physics','Stat','Math','CS'],
    'age' : [34, 30, 26,30,32,25,25,27],
    'city' : ['Sydney', 'Delhi', 'New york','ktm','ktm','Wilmington','Jakarta','Shanghai'],
    'salary':[8000, 1000,4000,10000,2500,3000,3000,10000]
}

In [20]:
dict_path = 'dict.p'

In [21]:
with open(dict_path, 'wb') as f:
        pickle.dump(student_dict, f)

In [22]:
student_dataframe = pd.DataFrame(student_dict)

In [23]:
dataframe_path = 'dataframe.p'

In [24]:
with open(dataframe_path, 'wb') as f:
        pickle.dump(student_dataframe, f)

In [25]:
student_dataframe

     name  subject  age        city  salary
0    jack       CS   34      Sydney    8000
1    Riti     Math   30       Delhi    1000
2    Aadi  English   26    New york    4000
3   prada  Physics   30         ktm   10000
4  Ramesh  Physics   32         ktm    2500
5  Niscal     Stat   25  Wilmington    3000
6      zu     Math   25     Jakarta    3000
7    Eric       CS   27    Shanghai   10000

# Read pickle files

In [30]:
with open(dataframe_path, 'rb') as f:
        check = pickle.load(f)

In [31]:
check

     name  subject  age        city  salary
0    jack       CS   34      Sydney    8000
1    Riti     Math   30       Delhi    1000
2    Aadi  English   26    New york    4000
3   prada  Physics   30         ktm   10000
4  Ramesh  Physics   32         ktm    2500
5  Niscal     Stat   25  Wilmington    3000
6      zu     Math   25     Jakarta    3000
7    Eric       CS   27    Shanghai   10000